title: Suspicious PowerShell Command Execution
id: 123e4567-e89b-12d3-a456-426614174000
description: Detects PowerShell executions with suspicious parameters for example encoded commands or hidden window execution.
status: experimental
author: -pk
date: 2025/07/10
logsource:
  category: process_creation
  product: windows
detection:
  selection:
    Image|endswith:
      - '\powershell.exe'
      - '\pwsh.exe'
    CommandLine|contains:
      - '-EncodedCommand'
      - '-NoProfile'
      - '-WindowStyle Hidden'
      - 'bypass'
  condition: selection
fields:
  - CommandLine
  - ParentImage
falsepositives:
  - Administrative scripts using encoded commands for automation (e.g., SCCM)
level: high
tags:
  - attack.execution
  - attack.t1059.001
